TexasInstruments/mcupsdk-core/examples/drivers/epwm/epwm_xcmp_dma/am263px-cc/r5fss0-0_nortos/example.syscfg
epwm5.$name                                                  = "CONFIG_EPWM4";
epwm5.epwmTimebase_period                                    = 100;
epwm5.epwmXCMP_enableMode                                    = true;
epwm5.epwmXCMP_SplitCheck                                    = true;
epwm5.epwmXCMP_Split_A                                       = "EPWM_XCMP_4_CMPA";
epwm5.epwmXCMP_Split_B                                       = "EPWM_XCMP_4_CMPB";
epwm5.epwmXCMP1_Active                                       = 10;
epwm5.epwmXCMP2_Active                                       = 20;
epwm5.epwmXCMP3_Active                                       = 30;
epwm5.epwmXCMP4_Active                                       = 40;
epwm5.epwmXCMP5_Active                                       = 50;
epwm5.epwmXCMP6_Active                                       = 60;
epwm5.epwmXCMP7_Active                                       = 70;
epwm5.epwmXCMP8_Active                                       = 80;
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_ACTIVE   = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_ACTIVE   = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_ACTIVE   = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_ACTIVE   = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmXTBPRD_Active                                      = 100;
epwm5.epwmXLOADCTL_Shadowlevel                               = "EPWM_XCMP_XLOADCTL_SHDWLEVEL_3";
epwm5.epwmXTBPRD_Shdw1                                       = 100;
epwm5.epwmXTBPRD_Shdw2                                       = 100;
epwm5.epwmXTBPRD_Shdw3                                       = 100;
epwm5.epwmXCMP1_Shdw1                                        = 10;
epwm5.epwmXCMP2_Shdw1                                        = 20;
epwm5.epwmXCMP3_Shdw1                                        = 30;
epwm5.epwmXCMP4_Shdw1                                        = 40;
epwm5.epwmXCMP5_Shdw1                                        = 50;
epwm5.epwmXCMP6_Shdw1                                        = 60;
epwm5.epwmXCMP7_Shdw1                                        = 70;
epwm5.epwmXCMP8_Shdw1                                        = 80;
epwm5.epwmXCMP1_Shdw2                                        = 10;
epwm5.epwmXCMP2_Shdw2                                        = 20;
epwm5.epwmXCMP3_Shdw2                                        = 30;
epwm5.epwmXCMP4_Shdw2                                        = 40;
epwm5.epwmXCMP5_Shdw2                                        = 50;
epwm5.epwmXCMP6_Shdw2                                        = 60;
epwm5.epwmXCMP7_Shdw2                                        = 70;
epwm5.epwmXCMP8_Shdw2                                        = 80;
epwm5.epwmXCMP1_Shdw3                                        = 10;
epwm5.epwmXCMP2_Shdw3                                        = 20;
epwm5.epwmXCMP3_Shdw3                                        = 30;
epwm5.epwmXCMP4_Shdw3                                        = 40;
epwm5.epwmXCMP5_Shdw3                                        = 50;
epwm5.epwmXCMP6_Shdw3                                        = 60;
epwm5.epwmXCMP7_Shdw3                                        = 70;
epwm5.epwmXCMP8_Shdw3                                        = 80;
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_1 = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_1 = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_1 = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_1 = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_2 = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_2 = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_2 = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_2 = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_3 = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_3 = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_3 = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_3 = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmXLOADCTL_RepeatBuf3                                = 5;
epwm5.epwmXLOADCTL_RepeatBuf2                                = 5;
epwm5.epwmTimebase_emulationMode                             = "EPWM_EMULATION_FREE_RUN";
epwm5.epwmXLOADCTL_Loadmode                                  = "EPWM_XCMP_XLOADCTL_LOADMODE_LOADMULTIPLE";
epwm5.EPWM.$assign                                           = "EPWM4";

epwm6.$name                                          = "ISR_SOURCE_EPWM";
epwm6.epwmTimebase_period                            = 100;
epwm6.epwmEventTrigger_enableInterrupt               = true;
epwm6.epwmEventTrigger_interruptSource               = "EPWM_INT_TBCTR_PERIOD";
epwm6.epwmEventTrigger_interruptEventCount           = "1";
epwm6.epwmEventTrigger_interruptEventCountInitEnable = true;
epwm6.EPWM.$assign                                   = "EPWM31";

const soc_ctrl_adc    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_adc", {}, false);
const soc_ctrl_adc1   = soc_ctrl_adc.addInstance({}, false);
soc_ctrl_adc1.$name   = "soc_ctrl_adc0";
const soc_ctrl        = scripting.addModule("/drivers/soc_ctrl/soc_ctrl", {}, false);
soc_ctrl.soc_ctrl_adc = soc_ctrl_adc1;

const soc_ctrl_cmpss    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_cmpss", {}, false);
const soc_ctrl_cmpss1   = soc_ctrl_cmpss.addInstance({}, false);
soc_ctrl_cmpss1.$name   = "soc_ctrl_cmpss0";
soc_ctrl.soc_ctrl_cmpss = soc_ctrl_cmpss1;

const soc_ctrl_epwm    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_epwm", {}, false);
const soc_ctrl_epwm1   = soc_ctrl_epwm.addInstance({}, false);
soc_ctrl_epwm1.$name   = "soc_ctrl_epwm0";
epwm.epwmTbClkSync     = soc_ctrl_epwm1;
soc_ctrl.soc_ctrl_epwm = soc_ctrl_epwm1;

const soc_ctrl_sdfm    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_sdfm", {}, false);
const soc_ctrl_sdfm1   = soc_ctrl_sdfm.addInstance({}, false);
soc_ctrl_sdfm1.$name   = "soc_ctrl_sdfm0";
soc_ctrl.soc_ctrl_sdfm = soc_ctrl_sdfm1;

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

